```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github-repository.github_issue_label.main["Terraform"] will be created
  + resource "github_issue_label" "main" {
      + color       = "e99695"
      + description = "Execute terraform workflow"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Terraform"
      + repository  = "playground.ashdavies.dev"
      + url         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->